Repository: AbdullahMQ1998/Masarifi
Catalog: lib/l10n/intl_*.arb
Languages: ar

# welcomeText
source: Welcome
ar: مرحبًا

# balanceToSpend
source: Total balance to spend
ar: الميزانية المقترحة

# saudiRyal
source: SAR
ar: ريال

source: Monthly Bills
ar: الفواتير الشهرية

# costInMonthsBubble
source: Cost:
ar: التكلفة:

source: Days left
ar: يوم متبقي

# expense
source: Expenses
ar: المصاريف

source: Add Expense
ar: أضف مصروف

source: Add Monthly Bill
ar: أضف فاتورة شهرية

source: Expense Name
ar: اسم المصروف

source: Expense Cost
ar: تكلفة المصروف

source: Expense Category
ar: نوع المصروف

source: Expense Date
ar: تاريخ المصروف

source: Add
ar: اضافة

source: Bill Name
ar: اسم الفاتورة

source: Bill Cost
ar: تكلفة الفاتورة

# billDate
source: Select Bill Date
ar: تاريخ دفع الفاتورة

source: Edit Expense
ar: تعديل المصروف

source: Update
ar: تعديل

source: Edit Monthly Bill
ar: تعديل فاتورة شهرية

source: Delete
ar: حذف

# dataAnalysisPageTitle
source: Masarifi Data Analysis
ar: تحليل البيانات في مصاريفي

# masarifiCategoryCount
source: Total Of Expense Per Category Between Masarifi Users
ar: عدد المصاريف لكل تصنيف في تطبيق مصاريفي

source: Most Category
ar: الأكثر عددًا

source: Least Category
ar: الأقل عددًا

# categoryChart
source: Expenses Total
ar: عدد المصاريف

# masaryfyAverageUsersCatefories
source: Average Expense Per Category Between Users Compare To You
ar: معدل المصاريف حسب النوع لمستخدمي تطبيق مصاريفي مقارنة بك

source: Avg Expense
ar: معدل المصاريف

source: Your Expense
ar: مصاريفك

source: Per User
ar: للمستخدم

source: Total:
ar: المجموع:

# mostAvgCategory
source: Most Average Category
ar: الأكثر للمستخدمين

source: Your Most Category
ar: الأكثر لك

# masarifiUserDaily
source: Masarifi Users Daily Expense Count
ar: عدد المصاريف لكل يوم في تطبيق مصاريفي

source: Daily Expense
ar: المصاريف اليومية

# lowestDay
source: Lowest Day of Purchase
ar: اقل يوم

# bestDay
source: Best Day of Purchase
ar: اكثر يوم

# masarifiMonthly
source: Masarifi Users Monthly Expense Count
ar: عدد المصاريف لكل شهر في تطبيق مصاريفي

source: Monthly Expense
ar: المصاريف الشهرية

# lowestMonth
source: Lowest Month Of Purchase
ar: اقل شهر

# bestMonth
source: Best Month Of Purchase
ar: اكثر شهر

source: Saving Plan
ar: خطة الأدخار

source: Needs
ar: مصاريف اساسية

source: Wants
ar: مصاريف تكميلية

source: Saving
ar: ادخار واسثتمار

# needsDefinition
source: Needs are expenses that you can’t avoid, payments for all the essentials that would be difficult to live without.
ar: المصاريف الاساسية هي المصاريف التي لا يمكن التخلي عنها و يصعب العيش بدونها.

# needsPercentage
source: 50% of your monthly income should cover your most necessary costs.
ar: خصص 50% من راتبك للمصاريف الأساسية وهي كافية لتغطية اغلب المصاريف الاساسية.

# basedOn
source: Based on your monthly income
ar: بناءً على دخلك الشهري

# yourBudgetNeeds
source: your budget on needs is
ar: ميزانيتك على المصاريف الاساسية هي

# yourBudgetWants
source: your budget on wants is
ar: ميزانيتك على المصاريف التكميلية هي

# wantsDefinition
source: Wants are defined as non-essential expenses—things that you choose to spend your money on, although you could live without them if you had to.
ar: المصاريف التكميلية هي مصاريف يمكن العيش بدونها وهي مصاريف لزيادة الرفاهية والمتعة.

# wantsPercentage
source: 30% of your monthly income can be used to cover your wants
ar: خصص 30% من راتبك للمصاريف التكميلية

# savingDefinition
source: Consistently putting aside 20% of your pay each month can help you build a better, more durable savings plan.
ar: ادخار 20% من دخلك الشهري يساعد على بناء خطة ادخار ممتازة لتحقيق اهداف مالية متسقبلية.

# savingPercentage
source: the remaining 20% can be put towards achieving your savings goals
ar: ال 20% المتبقية من الدخل يجب ان يسثتمر بها او ادخارها ولا يجب مسها الا للضرورة القصوى

# managedToSave
source: If you manged to save
ar: اذا استطعت ان تحافظ على

# investWith
source: every month and invest with 5% interest rate, you will ended up having
ar: لكل شهر واستثمرتها مع عائد سنوي 5%, سوف تتمكن من الحفاظ على

# yearsBasedOnRetireDay
source: in years based on your retirement date
ar: في سنوات بناءً على تاريخ تقاعدك

source: Edit Profile
ar: تعديل الملف الشخصي

source: Save
ar: حفظ

source: PREFERENCES
ar: التفضيلات

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الليلي

source: Sign Out
ar: تسجيل الخروج

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Monthly Income
ar: الدخل الشهري

source: Gender
ar: الجنس

source: Occupation
ar: الوضع الوظيفي

source: Delete Bill
ar: حذف الفاتورة

source: Delete Expense
ar: حذف المصروف

# wouldYouLikeDeleteMonthly
source: Would you like to delete the current monthly bill?
ar: هل تريد حذف الفاتورة الحالية؟

# wouldYouLikeDeleteExpense
source: Would you like to delete the current expense?
ar: هل تريد حذف المصروف الحالي؟

source: Confirm
ar: نعم

source: Cancel
ar: الغاء

source: Masarifi
ar: مصاريفي

source: Log In
ar: تسجيل دخول

source: Register
ar: تسجيل

# enterYourMail
source: Enter Your Email
ar: ادخل بريدك الإلكتروني

# enterYourPass
source: Enter Your Passowrd
ar: ادخل كلمة السر

source: Forgot Password?
ar: هل نسيت كلمة السر؟

source: Sign Up
ar: تسجيل

# dontHaveAccount
source: Don't have an account?
ar: لا يوجد لديك حساب؟

source: Login here
ar: سجل دخول

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب؟

source: Let's Get Started!
ar: حياك الله !

# createAnAccounttoMas
source: Create an account to Masarifi to get all the features
ar: انشئ حسابك في مصاريفي عشان تستفيد من كل خصائص التطبيق

# expectedRetireDay
source: Expected Retirement Date
ar: التاريخ المتوقع للتقاعد

# creatAnAccountButton
source: Create an account
ar: انشاء حساب

source: RetirementDate
ar: تاريخ التقاعد

# retirementDateAnswer
source: We need the retirement date to calculate the amount of years left to retire and use it to give the best advices to you
ar: نحتاج تاريخ التقاعد المتوقع عشان نعطيك نتائج ومعلومات تفيدك ونتمنى تختاره بجدية

source: Filter
ar: تصفية

source: to
ar: الى

source: Expense Type
ar: نوع المصروف

source: Search
ar: ابحث

source: Error
ar: خطأ

# overThousnd
source: Please enter amount over 999 for the monthly income
ar: الرجاء ادخال دخل شهري اكبر من 1000 ريال

source: Settings
ar: الأعدادات

# notifications
source: Don't forget to add your expenses 👀
ar: لا تنسى تضيف مصاريفك 👀

# exportExcel
source: Export Excel File
ar: تصدير ملف اكسل

# excelAlert
source: Excel reader is mandatory inorder to export Excel file
ar: يرجى التأكد من وجود قارئ اكسل لتصدير الملف

# createExcel
source: Create Excel File
ar: اصدار ملف اكسل

# rembmerMe
source: Remember Me
ar: تذكرني

# monthlyPageTitle
source: Monthly Reports
ar: التقارير الشهرية

# monthTitle
source: Month
ar: الشهر

source: Monthly Budget
ar: الميزانية الشهرية

source: Money Spent
ar: النقود المصروفة

source: Money Saved
ar: النقود المدخرة

# totalExpense
source: Total Expenses
ar: مجموع المصاريف

# noMonthlyBill
source: No monthly bills so far
ar: مافيه فواتير شهرية للحين , لا تنسى تضيف

# noExpenses
source: No expense for the current month, Let's add some!
ar: مافيه مصاريف مسجلة للشهر الحالي

# noMonthlyReport
source: No monthly reports, wait for the next month
ar: لا يوجد تقارير شهرية، انتظر للشهر القادم
